src/cf/Catalogs/СпособыВыплатыЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>СпособыВыплатыЗарплаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поставляемый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактерВыплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХарактерВыплатыЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Округление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОкругленияПриРасчетеЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИдентификаторОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ХарактерВыплатыЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ХарактерВыплатыЗарплаты</Name>
			<Comment>Выплата конкретного начисления, аванса или окончательная выплата зарплаты "под расчет"</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Аванс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарплата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/СпособыВыплатыЗарплаты/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область МетодыПолученияСпособовВыплаты

// Возвращает способ выплаты зарплаты по умолчанию
//
// Возвращаемое значение:
//  СправочникСсылка.СпособыВыплатыЗарплаты - способ выплаты зарплаты по умолчанию
//
Функция ПоУмолчанию() Экспорт
	Возврат ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.СпособыВыплатыЗарплаты.Зарплата");
КонецФункции	

// Возвращает способ выплаты зарплаты для аванса
//
// Возвращаемое значение:
//  СправочникСсылка.СпособыВыплатыЗарплаты - способ выплаты аванса
//
Функция Аванс() Экспорт
	
	ЗапросПоискаОбъекта = Новый Запрос;
	
	ЗапросПоискаОбъекта.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	                            |	СпособыВыплатыЗарплаты.Ссылка КАК Ссылка
	                            |ИЗ
	                            |	Справочник.СпособыВыплатыЗарплаты КАК СпособыВыплатыЗарплаты
	                            |ГДЕ
	                            |	НЕ СпособыВыплатыЗарплаты.ПометкаУдаления
	                            |	И СпособыВыплатыЗарплаты.ХарактерВыплаты = ЗНАЧЕНИЕ(Перечисление.ХарактерВыплатыЗарплаты.Аванс)
	                            |	И СпособыВыплатыЗарплаты.Поставляемый";
	
	Выборка = ЗапросПоискаОбъекта.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	ВзаиморасчетыССотрудникамиВызовСервера.СпособыВыплатыЗарплатыОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

Процедура НачальноеЗаполнение() Экспорт
	ВзаиморасчетыССотрудникамиВнутренний.СпособыВыплатыЗарплатыНачальноеЗаполнение();
КонецПроцедуры

Процедура ОбновитьУдаленныеПредопределенные() Экспорт
	
	СпособВыплатыСсылка = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.СпособыВыплатыЗарплаты.Зарплата");
	
	Если СпособВыплатыСсылка <> Неопределено И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СпособВыплатыСсылка, "ПометкаУдаления") Тогда
		
		СпособВыплаты = СпособВыплатыСсылка.ПолучитьОбъект();
		СпособВыплаты.ПометкаУдаления = Ложь;
		СпособВыплаты.Записать();
		
	КонецЕсли;
	
	ЗапросПоискаОбъекта = Новый Запрос;
	
	ЗапросПоискаОбъекта.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	                            |	СпособыВыплатыЗарплаты.Ссылка КАК Ссылка
	                            |ИЗ
	                            |	Справочник.СпособыВыплатыЗарплаты КАК СпособыВыплатыЗарплаты
	                            |ГДЕ
	                            |	СпособыВыплатыЗарплаты.ПометкаУдаления
	                            |	И СпособыВыплатыЗарплаты.Наименование = &Наименование";
	
	ЗапросПоискаОбъекта.УстановитьПараметр("Наименование", "Аванс");
	
	Выборка = ЗапросПоискаОбъекта.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		СпособВыплаты = Выборка.Ссылка.ПолучитьОбъект();
		СпособВыплаты.ПометкаУдаления = Ложь;
		СпособВыплаты.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПризнакПоставляемый() Экспорт
	ВзаиморасчетыССотрудникамиВнутренний.СпособыВыплатыЗарплатыЗаполнитьПризнакПоставляемый()	
КонецПроцедуры

Процедура ЗаполнитьОкругление() Экспорт
	
	СпособОкругленияПоУмолчанию = Справочники.СпособыОкругленияПриРасчетеЗарплаты.ПоУмолчанию();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СпособыВыплатыЗарплаты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СпособыВыплатыЗарплаты КАК СпособыВыплатыЗарплаты
	|ГДЕ
	|	СпособыВыплатыЗарплаты.Округление = ЗНАЧЕНИЕ(Справочник.СпособыОкругленияПриРасчетеЗарплаты.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СпособВыплаты = Выборка.Ссылка.ПолучитьОбъект();
		СпособВыплаты.Округление = СпособОкругленияПоУмолчанию;
		СпособВыплаты.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьХарактерВыплаты() Экспорт
	
	СпособВыплатыЗарплата = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.СпособыВыплатыЗарплаты.Зарплата");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СпособыВыплатыЗарплаты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СпособыВыплатыЗарплаты КАК СпособыВыплатыЗарплаты
	|ГДЕ
	|	СпособыВыплатыЗарплаты.ХарактерВыплаты = ЗНАЧЕНИЕ(Перечисление.ХарактерВыплатыЗарплаты.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СпособВыплаты = Выборка.Ссылка.ПолучитьОбъект();
		
		Если Выборка.Ссылка = СпособВыплатыЗарплата Тогда
			СпособВыплаты.ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Зарплата;
		Иначе
			СпособВыплаты.ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Аванс;
		КонецЕсли;	
		
		СпособВыплаты.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
	
#КонецОбласти

#КонецЕсли
